Revit 2026 API

# TransmissionDataUserData Property

---

A string which users can store notes in.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string UserData { get; set; }
```
```vb
Public Property UserData As String
	Get
	Set
```
```cpp
public:
property String^ UserData {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member UserData : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

TransmissionData Class

Autodesk.Revit.DB Namespace